app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings

      if session[:ratings].nil?
        @ratings_to_show = Movie.all_ratings
        @sorting = nil
        @title_selected = ""
        @release_selected = ""
      else
        @ratings_to_show = params[:ratings] || Movie.all_ratings
      end

      session[:ratings] = @ratings_to_show
      @sorting = params[:sort]

      selected = "hilite p-3 mb-2 bg-warning text-dark"

      if !@sorting.nil?
        session[:sort] = @sorting
      else
        @sorting = session[:sort]
      end

      if @sorting == 'title'
        @movies = Movie.order('title').where(rating: @ratings_to_show.keys)
        @title_selected = selected
      elsif @sorting == 'release_date'
        @movies = Movie.order("#{@sorting} ASC").with_ratings(rating: @ratings_to_show.keys)
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."PG-13" = '1' AND "rating"."R" = '1'  ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = ?  ORDER BY release_date  [["rating", "G"]]